Can't convert Edges to Analytical Model curves.
  Namespace:   Autodesk.Revit.DB
  Assembly:   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
 Syntax
  C#
public static FailureDefinitionId StructWallAnalyticalErrorConversion { get; }
  Visual Basic
Public Shared ReadOnly Property StructWallAnalyticalErrorConversion As FailureDefinitionId
	Get
  Visual C++
public:
static property FailureDefinitionId^ StructWallAnalyticalErrorConversion {
	FailureDefinitionId^ get ();
}
 See Also
  BuiltInFailures AnalyticalModelFailures Class
  Autodesk.Revit.DB Namespace